Documents/КомплектацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КомплектацияОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоставОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскоеОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеВСоставеОС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСостоянийВСоставеОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КомплектацияОС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			ДанныеЗаполнения.Удалить("Автор");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеВнеоборотнымиАктивамиСервер.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", Новый Структура("ОсновноеСредство"), Отказ);

	ПроверитьПострочноТаблицуОС(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.КомплектацияОС.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если вдруг не удалось получить параметры проведения и не установлен флаг Отказ, то просто выйдем из проведения
	Если ПараметрыПроведения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроведения.СобытияОСОрганизацийТаблицаОС.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияРегистрацияСобытияОС(ПараметрыПроведения.СобытияОСОрганизацийТаблицаОС, 
														ПараметрыПроведения.Реквизиты,
														Движения, Отказ);
	КонецЕсли;

	Если ПараметрыПроведения.СоставОСТаблицаОС.Количество() <> 0 Тогда 
		УчетОС.СформироватьДвиженияСоставОС(ПараметрыПроведения.СоставОСТаблицаОС,
				ПараметрыПроведения.Реквизиты,
				Движения, Отказ);
	КонецЕсли;


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	              	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПроверитьПострочноТаблицуОС(Отказ)
	
	ТаблицаОС = ОС.Выгрузить();
	ТаблицаОС.Свернуть("ОсновноеСредство");
	СписокОС = ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	//сначала найдем тек. информацию по комплектации для всех ОС
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОС"	  , СписокОС);
	Запрос.УстановитьПараметр("ДатаДок"		  , Дата);
	Запрос.УстановитьПараметр("РодительскоеОС", РодительскоеОсновноеСредство);
	Запрос.УстановитьПараметр("Регистратор"	  , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставОССрезПоследних.ВСоставеОС,
	|	СоставОССрезПоследних.СостояниеВСоставеОС,
	|	СоставОССрезПоследних.ОсновноеСредство,
	|	СоставОССрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.СоставОС.СрезПоследних(
	|			&ДатаДок,
	|			ОсновноеСредство В (&СписокОС)
	|				И Регистратор <> &Регистратор) КАК СоставОССрезПоследних";		
	
	ТаблицаСоставОС = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаОС Из ОС Цикл
		
		ПутьКСтрокеТЧ = "ОС" + "[" + Формат(СтрокаОС.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]";
		
		СтрокаСоставОС = Неопределено;
		Если ТаблицаСоставОС.Количество() <> 0 Тогда
			СтрокаСоставОС = ТаблицаСоставОС.Найти(СтрокаОС.ОсновноеСредство, "ОсновноеСредство");
		КонецЕсли;
		
		Если СтрокаСоставОС <> Неопределено Тогда
			
			Если СтрокаОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ВключеноВСостав Тогда
				// пытаются включить основное средство, которое уже содержится в комплекте другого ОС.
				Если (СтрокаСоставОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ВключеноВСостав) Тогда	
					
					ТекстСообщения = НСтр("ru='<%1> код <%2> уже содержится  в составе ОС: <%3> .'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																	СтрокаОС.ОсновноеСредство, СокрЛП(СтрокаОС.ОсновноеСредство.Код),
																	СтрокаСоставОС.ВСоставеОС);
				
					Поле = ПутьКСтрокеТЧ + ".СостояниеВСоставеОС";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
					
					Отказ = Истина;
					Возврат;
				КонецЕсли;	
				
			ИначеЕсли СтрокаОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ИсключеноИзСостава Тогда	
				
				Если (СтрокаСоставОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ИсключеноИзСостава) Тогда
					
					// пытаются исключить ОС, которое уже было исключено из состава данного родительского ОС	   
					Если (СтрокаСоставОС.ВСоставеОС = РодительскоеОсновноеСредство) Тогда
													
						ТекстСообщения = НСтр("ru='<%1> код <%2> уже было исключено из состава ОС: <%3> .'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																	СтрокаОС.ОсновноеСредство, СокрЛП(СтрокаОС.ОсновноеСредство.Код),
																	РодительскоеОсновноеСредство);
				
						Поле = ПутьКСтрокеТЧ + ".СостояниеВСоставеОС";
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				
						Отказ = Истина;
						Возврат;
					// пытаются исключить основное средство, которое уже было исключено из состава какого-либо основного средства 	
					// но не включено в состав текущего родительского ОС.
					Иначе
						
						ТекстСообщения = НСтр("ru='<%1> код <%2> не содержится в составе ОС: <%3> . Чтобы исключить из комплекта, необходимо сначала включить его в состав комплекта.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																	СтрокаОС.ОсновноеСредство, СокрЛП(СтрокаОС.ОсновноеСредство.Код),
																	РодительскоеОсновноеСредство);
				
						Поле = ПутьКСтрокеТЧ + ".СостояниеВСоставеОС";
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
						
						Отказ = Истина;
						Возврат;
					КонецЕсли;
				
				ИначеЕсли  (СтрокаСоставОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ВключеноВСостав) Тогда
				
					Если (СтрокаСоставОС.ВСоставеОС <> РодительскоеОсновноеСредство) Тогда
						// пытаются исключить ОС, которое не содержится в комплекте данного ОС.	
						
						ТекстСообщения = НСтр("ru='<%1> код <%2> не содержится в составе ОС: <%3> . Чтобы исключить из комплекта, необходимо сначала включить его в состав комплекта.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																	СтрокаОС.ОсновноеСредство, СокрЛП(СтрокаОС.ОсновноеСредство.Код),
																	РодительскоеОсновноеСредство);
				
						Поле = ПутьКСтрокеТЧ + ".СостояниеВСоставеОС";
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
						
						Отказ = Истина;
						Возврат;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		ИначеЕсли СтрокаОС.СостояниеВСоставеОС = Перечисления.ВидыСостоянийВСоставеОС.ИсключеноИзСостава Тогда
			
				
			ТекстСообщения = НСтр("ru='<%1> код <%2> не содержится в составе ОС: <%3> . Чтобы исключить из комплекта, необходимо сначала включить его в состав комплекта.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
																	СтрокаОС.ОсновноеСредство, СокрЛП(СтрокаОС.ОсновноеСредство.Код),
																	РодительскоеОсновноеСредство);
				
			Поле = ПутьКСтрокеТЧ + ".СостояниеВСоставеОС";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			
			Отказ = Истина;
			Возврат;
						
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры


#КонецЕсли
